; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 178387 2 1 2 7 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star6 - direction
	Star5 - direction
	Star4 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
)
(:goal (and
	(pointing satellite1 Planet7)
	(have_image Planet7 thermograph0)
	(have_image Planet8 image1)
	(have_image Phenomenon9 image1)
	(have_image Planet10 image1)
	(have_image Phenomenon11 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star5)
   goals met: 0 of 6
4. (turn_to satellite1 star4 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 6
7. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   goals met: 0 of 6
8. (turn_to satellite1 planet8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet8)
   goals met: 0 of 6
9. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 1 of 6
10. (take_image satellite1 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 2 of 6
11. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 3 of 6
12. (turn_to satellite1 planet10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet10)
   goals met: 2 of 6
13. (take_image satellite1 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 6
14. (turn_to satellite1 planet7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet7)
   goals met: 4 of 6
15. (turn_to satellite1 phenomenon9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 6
16. (take_image satellite1 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 4 of 6
17. (turn_to satellite1 planet7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet7)
   goals met: 5 of 6
18. (turn_to satellite1 phenomenon11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 6
19. (take_image satellite1 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 6
20. (turn_to satellite1 planet7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet7)
   goals met: 6 of 6
